user_story_app/app/controllers/stories_controller.rb

  def index

    # find all the alpha stories belonging to a specific user
    # via searching where ancestry equals nil
    alpha_stories = Story.where(:user_id => params[:user_id], :ancestry => nil)


    # loop through those alpha stories and generate each alpha stories
    # hash representation -- grow the tree
    hashed_stories = []
    alpha_stories.each do |alpha_story|
      hashed_stories << alpha_story.create_hash_representation
---
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = 4 ORDER BY (case when stories.ancestry is null then 0 else 1 end), stories.ancestry
SELECT "stories".* FROM "stories" WHERE "stories"."id" IN (2) ORDER BY (case when stories.ancestry is null then 0 else 1 end), stories.ancestry
INSERT INTO "stories" ("ancestry", "as_a", "complete", "created_at", "i_want_to", "so_i_can", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("ancestry", "as_a", "complete", "created_at", "i_want_to", "so_i_can", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"